balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ16MC102.PIC
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="P1DTCON2" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="P1DTCON2" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="DTCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTS1I" edc:desc="" edc:mask="0x1" edc:name="DTS1I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS1A" edc:desc="" edc:mask="0x1" edc:name="DTS1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2I" edc:desc="" edc:mask="0x1" edc:name="DTS2I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2A" edc:desc="" edc:mask="0x1" edc:name="DTS2A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3I" edc:desc="" edc:mask="0x1" edc:name="DTS3I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3A" edc:desc="" edc:mask="0x1" edc:name="DTS3A" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnn----nnn" edc:cname="P1FLTACON" edc:desc="" edc:impl="0x3f87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0000000----000" edc:name="P1FLTACON" edc:nzwidth="0x10" edc:por="--0000000----000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="FLTACON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FAEN1" edc:desc="" edc:mask="0x1" edc:name="FAEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN2" edc:desc="" edc:mask="0x1" edc:name="FAEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN3" edc:desc="" edc:mask="0x1" edc:name="FAEN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTAM" edc:desc="" edc:mask="0x1" edc:name="FLTAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1L" edc:desc="" edc:mask="0x1" edc:name="FAOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1H" edc:desc="" edc:mask="0x1" edc:name="FAOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2L" edc:desc="" edc:mask="0x1" edc:name="FAOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2H" edc:desc="" edc:mask="0x1" edc:name="FAOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3L" edc:desc="" edc:mask="0x1" edc:name="FAOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3H" edc:desc="" edc:mask="0x1" edc:name="FAOV3H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnn----nnn" edc:cname="P1FLTBCON" edc:desc="" edc:impl="0x3f87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0000000----000" edc:name="P1FLTBCON" edc:nzwidth="0x10" edc:por="--0000000----000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="FLTBCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FBEN1" edc:desc="" edc:mask="0x1" edc:name="FBEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN2" edc:desc="" edc:mask="0x1" edc:name="FBEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN3" edc:desc="" edc:mask="0x1" edc:name="FBEN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTBM" edc:desc="" edc:mask="0x1" edc:name="FLTBM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1L" edc:desc="" edc:mask="0x1" edc:name="FBOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1H" edc:desc="" edc:mask="0x1" edc:name="FBOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2L" edc:desc="" edc:mask="0x1" edc:name="FBOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2H" edc:desc="" edc:mask="0x1" edc:name="FBOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3L" edc:desc="" edc:mask="0x1" edc:name="FBOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3H" edc:desc="" edc:mask="0x1" edc:name="FBOV3H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="P1OVDCON" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--000000" edc:name="P1OVDCON" edc:nzwidth="0x10" edc:por="--111111--000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="OVDCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT1L" edc:desc="" edc:mask="0x1" edc:name="POUT1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1H" edc:desc="" edc:mask="0x1" edc:name="POUT1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2L" edc:desc="" edc:mask="0x1" edc:name="POUT2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2H" edc:desc="" edc:mask="0x1" edc:name="POUT2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3L" edc:desc="" edc:mask="0x1" edc:name="POUT3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3H" edc:desc="" edc:mask="0x1" edc:name="POUT3H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POVD1L" edc:desc="" edc:mask="0x1" edc:name="POVD1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1H" edc:desc="" edc:mask="0x1" edc:name="POVD1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2L" edc:desc="" edc:mask="0x1" edc:name="POVD2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2H" edc:desc="" edc:mask="0x1" edc:name="POVD2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3L" edc:desc="" edc:mask="0x1" edc:name="POVD3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3H" edc:desc="" edc:mask="0x1" edc:name="POVD3H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P1DC1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P1DC1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PDC1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMDC1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PWMDC1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P1DC2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P1DC2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PDC2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMDC2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PWMDC2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
